import React from "react";
import { prose } from "@/styled-system/recipes";
import { center } from "@/styled-system/patterns";

export default () => (
    <div
        className={center({
            mx: "auto",
        })}
    >
        <div className={prose()}>
            <p>这是 Panda CSS Prose 测试。</p>
            <ul>
                <li>列表项目！</li>
                <li>列表项目！！</li>
                <li>列表项目！！！</li>
            </ul>
            <h2>一</h2>
            <p>我好想做嘉然小姐的狗啊。</p>
            <p>可是嘉然小姐说她喜欢的是猫，我哭了。</p>
            <p>我知道既不是狗也不是猫的我为什么要哭的。因为我其实是一只老鼠。</p>
            <p>
                我从没奢望嘉然小姐能喜欢自己。我明白的，所有人都喜欢理解余裕上手天才打钱的萌萌的狗狗或者猫猫，没有人会喜欢阴湿带病的老鼠。
            </p>
            <p>但我还是问了嘉然小姐:“我能不能做你的狗？”</p>
            <p>我知道我是注定做不了狗的。但如果她喜欢狗，我就可以一直在身边看着她了，哪怕她怀里抱着的永远都是狗。</p>
            <p>可是她说喜欢的是猫。</p>
            <p>
                她现在还在看着我，还在逗我开心，是因为猫还没有出现，只有我这老鼠每天蹑手蹑脚地从洞里爬出来，远远地和她对视。
            </p>
            <p>等她喜欢的猫来了的时候，我就该重新滚回我的洞了吧。</p>
            <p>但我还是好喜欢她，她能在我还在她身边的时候多看我几眼吗？</p>
            <p>
                嘉然小姐说接下来的每个圣诞夜都要和大家一起过。我不知道大家指哪些人。好希望这个集合能够对我做一次胞吞。
            </p>
            <p>猫猫还在害怕嘉然小姐。</p>
            <p>我会去把她爱的猫猫引来的。</p>
            <p>我知道稍有不慎，我就会葬身猫口。</p>
            <p>那时候嘉然小姐大概会把我的身体好好地装起来扔到门外吧。</p>
            <p>那我就成了一包鼠条，嘻嘻。</p>
            <p>我希望她能把我扔得近一点，因为我还是好喜欢她。会一直喜欢下去的。</p>
            <p>
                我的灵魂透过窗户向里面看去，挂着的铃铛在轻轻鸣响，嘉然小姐慵懒地靠在沙发上，表演得非常温顺的橘猫坐在她的肩膀。壁炉的火光照在她的脸庞，我冻僵的心脏在风里微微发烫。
            </p>
            <h2 className="wp-block-heading">二</h2>
            <p>
                只有在嘉然的直播间，我才好意思自称v8🐭。可我知道，总有一天，嘉然会穿上燕尾服的，会在更大，更华丽舞台上起舞。我也明白，为她穿上衣服的那个人不可能会是我。到那时，我会把自己的肉体锁在笼子里，我的灵魂会化作台下的观众，穿着一身尘封已久的西装，单膝跪地，递上一束我精心准备的鲜花，轻声问道：“嘉然小姐，我能成为嘉然小姐的狗吗？”
            </p>
            <p>她笑着回我：“唉，为什么要当狗啊，难道你会学狗叫吗”</p>
            <p>
                我听到了台下此起彼伏的附和声“汪汪汪”，我也笑了，想要回复，我张大了嘴巴，可是喉咙却怎么也发不出声音，我感觉嘉然的身影离我越来越远，回过神来，我的眼前只剩下紧锁的大门。“这样也好”，我笑的更大声了，“在下一位灰姑娘敲开大门的那一天之前，我会老实的待在笼子里的，嘉然小姐😇”
            </p>
            <h2 className="wp-block-heading">三</h2>
            <p>亵渎嘉然的人有难了，因为asoul的国将对他紧闭！</p>
            <p>计量嘉然的人有难了，因为他也必在永火之中被计量！</p>
            <p>为嘉然排序的人有难了，因为怜悯在不敬者的头上是黯淡的，嘉然也必将其排在义人之后！</p>
            <p>
                我见兽从雪山中来，有二角一尾，在角上戴着十个冠冕，头上有亵渎的名号。不义的人都跟从那兽，又拜它作皇，因为有权柄赐她，可以说讥讽隐晦话的口，兽就开口亵渎嘉然的名并牠的帐幕。牠必折磨至高者的圣民，逼迫他们背反嘉然的诫命。牠必在众人前行异事，好夸大她的微小，以迷惑地上的蒙昧者追随她，将她捧到高云之上，称作人之国的王。她又召集众人，不论贫富老幼，刻下兽的印记，并赐给权柄，与她一并说隐藏的话，亵渎嘉然所称的义，贬损她
                的名。
            </p>
            <p>凡有智慧的，可以计算兽印的轮廓。因为那是众人的数目，它的形状是👻👻👻</p>
            <p>
                她领受了权柄可肆意妄行二十四个月，但在期满后我又见一位天使站在海上手持锁链将兽擒拿，让她从天上坠落，而那些被兽迷惑领受了印的，行奇事的，将嘉然排在兽后的也同被擒拿，他们被投入硫磺的火湖中，嘉人们饱食了他们的肉。
            </p>
            <p>🙏🏻嘉门🙏🏻</p>
            <h2 className="wp-block-heading">四</h2>
            <p>我宣布，“可爱”是嘉然的专属词语，以后任何人，任何组织，运用“可爱”时，必须向嘉❤糖写书面申请</p>
            <h2 className="wp-block-heading">五</h2>
            <p>
                我真的想嘉然做仰卧起坐想得要发疯了。我躺在床上会想嘉然做仰卧起坐，我洗澡会想嘉然做仰卧起坐，我出门会想嘉然做仰卧起坐，我走路会想嘉然做仰卧起坐，我坐车会想嘉然做仰卧起坐，我工作会想嘉然做仰卧起坐，我玩手机会想嘉然做仰卧起坐，我每时每刻眼睛都直直地盯着嘉然看，像一台雷达一样扫视每一个视频里逃避做仰卧起坐的嘉然，我对嘉然做仰卧起坐的念想似乎都是病态的了，我好孤独啊！真的好孤独啊！嘉然为什么不做仰卧起坐？
            </p>
            <h2 className="wp-block-heading">六</h2>
            <p>
                嘉然的脚小小的香香的，不像手经常使用来得灵活，但有一种独特的可爱的笨拙，嫩嫩的脚丫光滑细腻，凌莹剔透，看得见皮肤下面细细的血管与指甲之下粉白的月牙。再高冷的女生小脚也是敏感的害羞的，轻轻挠一挠，她就摇身一变成为娇滴滴的女孩，脚丫像是一把钥匙，轻轻掌握它就能打开女孩子的心灵。
            </p>
            <h2 className="wp-block-heading">七</h2>
            <p>记得20岁那年，第一次嗦然然的脚趾。</p>
            <p>快舔上的时候，然然突然说等一下。我就纳闷了，然然要干嘛？</p>
            <p>只见然然小心翼翼地从兜里拿出酱油，芥末辣椒，她让我挑一个喜欢的。我指了一下那个酱油的，然后问她干嘛？</p>
            <p>她二话不说马上把酱油往脚上倒，然后一把扯过我的脖子，我就含住了然然的脚趾，全程一股酱油味。</p>
            <p>
                后来然然跟我说，人生那么长，我没有自信能让你记住我，但是你既然喜欢酱油，我只能让你记住，我的脚是酱油味的，这样以后你吃酱油都能想起我。
            </p>
            <p>
                如今我已经很久没有回枝江了，每次吃酱油都会想起然然，家里固定有酱油，想然然了都会喝上一口，就好像在给她嗦脚趾。
            </p>
            <h2 className="wp-block-heading">八</h2>
            <p>
                我想像狗一样趴在地上，等待嘉然的眷顾。娇小的少女会脱下小皮鞋，提起她的裙摆，用她穿着白色短袜的玉卒不屑地踩到我的背上，随后碾过我的脖颈、我的脸、我的四肢……我能同时感受到短袜的柔软质地和少女细嫩的皮肤，给人带来至高无上的逾越。
            </p>
            <h2 className="wp-block-heading">九</h2>
            <p>
                6:30 按掉闹钟，解决脑内“我到底是否需要这份工作”的天人之争，囫囵洗脸刷牙，离开出租屋骑着共享单车前往工厂
            </p>
            <p>8:00 在一片茫然中结束早会，依靠下意识的反应穿好无尘服，取下出料单开始操作机器</p>
            <p>11:30 良率又出了问题，看来又没法按时吃午饭了，心情焦躁不安，旁边的操作工有一搭没一搭地调笑闲聊着</p>
            <p>
                14:00 食堂的午饭味同嚼蜡，随便扒拉了两口，也没有了午睡的时间，经理对产品的延期大发雷霆，训话持续到了现在
            </p>
            <p>
                15:00 新来的助工小伙子十分殷勤，似乎是想学两手，故作神秘地打发掉他，其实所谓的技术也不过就是调整几个参数
            </p>
            <p>16:30 快下班了，装作认真干活，私下拼命刷新动态，已经礼拜二了，这周的QA怎么还不发</p>
            <p>
                20:00 瘫在椅子上，加班的劳累淹没了四肢，把昨晚许下收拾房间的诺言抛在身后，嘉然今天没有直播安排，不想动弹
            </p>
            <p>21:00 在网上四处出击，毫无破绽就像个战神。出租屋的空间对一个人来说也不够大，在网上冲浪更让人自在</p>
            <p>
                21:30
                昨天一时上头打了30sc，于是今天晚饭的鸡胸肉少切了一半。电磁炉的功率太小，半吊子热量只能做出半吊子的菜
            </p>
            <p>
                22:00
                隔壁房的一家三口睡下了，郊区寂静的空气重新淹没了屋子。家里老人的手机坏了，没法远程解决问题，心里有些焦虑
            </p>
            <p>
                23:30 用有限的热水洗完澡，赶紧关掉了电热水器的闸。是时候该睡觉了，但手机里亮着的是嘉然在录播里明媚的笑颜
            </p>
            <p>24:00 大城市的郊区有着明亮的月亮，明天的露水在墙上凝结</p>
            <p>00:20 晚安。还有，明天见，嘉然小姐</p>
            <h2 className="wp-block-heading">十</h2>
            <p>我知道然然也是打工人</p>
            <p>也吃自己煎的鸡胸肉</p>
            <p>只是为了完成KPI</p>
            <p>假装喜欢我们</p>
            <p>但是我没关系的</p>
            <p>我也可以假装喜欢你</p>
            <p>就像你是虚拟偶像一样</p>
            <p>我是你虚拟的粉丝</p>
            <p>我可以演很长很长时间</p>
        </div>
    </div>
);
